OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1773.h
/*
 * This declarations of the PIC16LF1773 MCU.
 *
 * This file is part of the GNU PIC library for SDCC, originally
 * created by Molnar Karoly <molnarkaroly@users.sf.net> 2016.
 *
 * This file is generated automatically by the cinc2h.pl, 2016-04-13 17:23:15 UTC.
 *
 * SDCC is licensed under the GNU Public license (GPL) v2. Note that
 * this license covers the code to the compiler and other executables,
 * but explicitly does not cover any code or objects generated by sdcc.
 *
 * For pic device libraries and header files which are derived from
 * Microchip header (.inc) and linker script (.lkr) files Microchip
 * requires that "The header files should state that they are only to be
 * used with authentic Microchip devices" which makes them incompatible
 * with the GPL. Pic device libraries and header files are located at
 * non-free/lib and non-free/include directories respectively.
 * Sdcc should be run with the --use-non-free command line option in
 * order to include non-free header files and libraries.
 *
 * See http://sdcc.sourceforge.net/ for the latest information on sdcc.
 */

#ifndef __PIC16LF1773_H__
#define __PIC16LF1773_H__

//==============================================================================
//
//	Register Addresses
//
//==============================================================================

#ifndef NO_ADDR_DEFINES

#define INDF0_ADDR              0x0000
#define INDF1_ADDR              0x0001
#define PCL_ADDR                0x0002
#define STATUS_ADDR             0x0003
#define FSR0_ADDR               0x0004
#define FSR0L_ADDR              0x0004
#define FSR0H_ADDR              0x0005
#define FSR1_ADDR               0x0006
#define FSR1L_ADDR              0x0006
#define FSR1H_ADDR              0x0007
#define BSR_ADDR                0x0008
#define WREG_ADDR               0x0009
#define PCLATH_ADDR             0x000A
#define INTCON_ADDR             0x000B
#define PORTA_ADDR              0x000C
#define PORTB_ADDR              0x000D
#define PORTC_ADDR              0x000E
#define PORTE_ADDR              0x0010
#define PIR1_ADDR               0x0011
#define PIR2_ADDR               0x0012
#define PIR3_ADDR               0x0013
#define PIR4_ADDR               0x0014
#define PIR5_ADDR               0x0015
#define PIR6_ADDR               0x0016
#define TMR0_ADDR               0x0017
#define TMR1_ADDR               0x0018
#define TMR1L_ADDR              0x0018
#define TMR1H_ADDR              0x0019
#define T1CON_ADDR              0x001A
#define T1GCON_ADDR             0x001B
#define TMR3_ADDR               0x001C
#define TMR3L_ADDR              0x001C
#define TMR3H_ADDR              0x001D
#define T3CON_ADDR              0x001E
#define T3GCON_ADDR             0x001F
#define TRISA_ADDR              0x008C
#define TRISB_ADDR              0x008D
#define TRISC_ADDR              0x008E
#define TRISE_ADDR              0x0090
#define PIE1_ADDR               0x0091
#define PIE2_ADDR               0x0092
#define PIE3_ADDR               0x0093
#define PIE4_ADDR               0x0094
#define PIE5_ADDR               0x0095
#define PIE6_ADDR               0x0096
#define OPTION_REG_ADDR         0x0097
#define PCON_ADDR               0x0098
#define WDTCON_ADDR             0x0099
#define OSCTUNE_ADDR            0x009A
#define OSCCON_ADDR             0x009B
#define OSCSTAT_ADDR            0x009C
#define BORCON_ADDR             0x009D
#define FVRCON_ADDR             0x009E
#define ZCD1CON_ADDR            0x009F
#define LATA_ADDR               0x010C
#define LATB_ADDR               0x010D
#define LATC_ADDR               0x010E
#define CMOUT_ADDR              0x0111
#define CM1CON0_ADDR            0x0112
#define CM1CON1_ADDR            0x0113
#define CM1NSEL_ADDR            0x0114
#define CM1PSEL_ADDR            0x0115
#define CM2CON0_ADDR            0x0116
#define CM2CON1_ADDR            0x0117
#define CM2NSEL_ADDR            0x0118
#define CM2PSEL_ADDR            0x0119
#define CM3CON0_ADDR            0x011A
#define CM3CON1_ADDR            0x011B
#define CM3NSEL_ADDR            0x011C
#define CM3PSEL_ADDR            0x011D
#define ANSELA_ADDR             0x018C
#define ANSELB_ADDR             0x018D
#define ANSELC_ADDR             0x018E
#define PMADR_ADDR              0x0191
#define PMADRL_ADDR             0x0191
#define PMADRH_ADDR             0x0192
#define PMDAT_ADDR              0x0193
#define PMDATL_ADDR             0x0193
#define PMDATH_ADDR             0x0194
#define PMCON1_ADDR             0x0195
#define PMCON2_ADDR             0x0196
#define RC1REG_ADDR             0x0199
#define RCREG_ADDR              0x0199
#define RCREG1_ADDR             0x0199
#define TX1REG_ADDR             0x019A
#define TXREG_ADDR              0x019A
#define TXREG1_ADDR             0x019A
#define SP1BRG_ADDR             0x019B
#define SP1BRGL_ADDR            0x019B
#define SPBRG_ADDR              0x019B
#define SPBRG1_ADDR             0x019B
#define SPBRGL_ADDR             0x019B
#define SP1BRGH_ADDR            0x019C
#define SPBRGH_ADDR             0x019C
#define SPBRGH1_ADDR            0x019C
#define RC1STA_ADDR             0x019D
#define RCSTA_ADDR              0x019D
#define RCSTA1_ADDR             0x019D
#define TX1STA_ADDR             0x019E
#define TXSTA_ADDR              0x019E
#define TXSTA1_ADDR             0x019E
#define BAUD1CON_ADDR           0x019F
#define BAUDCON_ADDR            0x019F
#define BAUDCON1_ADDR           0x019F
#define BAUDCTL_ADDR            0x019F
#define BAUDCTL1_ADDR           0x019F
#define WPUA_ADDR               0x020C
#define WPUB_ADDR               0x020D
#define WPUC_ADDR               0x020E
#define WPUE_ADDR               0x0210
#define SSP1BUF_ADDR            0x0211
#define SSPBUF_ADDR             0x0211
#define SSP1ADD_ADDR            0x0212
#define SSPADD_ADDR             0x0212
#define SSP1MSK_ADDR            0x0213
#define SSPMSK_ADDR             0x0213
#define SSP1STAT_ADDR           0x0214
#define SSPSTAT_ADDR            0x0214
#define SSP1CON_ADDR            0x0215
#define SSP1CON1_ADDR           0x0215
#define SSPCON_ADDR             0x0215
#define SSPCON1_ADDR            0x0215
#define SSP1CON2_ADDR           0x0216
#define SSPCON2_ADDR            0x0216
#define SSP1CON3_ADDR           0x0217
#define SSPCON3_ADDR            0x0217
#define MD3CON0_ADDR            0x021B
#define MD3CON1_ADDR            0x021C
#define MD3SRC_ADDR             0x021D
#define MD3CARL_ADDR            0x021E
#define MD3CARH_ADDR            0x021F
#define ODCONA_ADDR             0x028C
#define ODCONB_ADDR             0x028D
#define ODCONC_ADDR             0x028E
#define CCPR1_ADDR              0x0291
#define CCPR1L_ADDR             0x0291
#define CCPR1H_ADDR             0x0292
#define CCP1CON_ADDR            0x0293
#define CCP1CAP_ADDR            0x0294
#define CCPR2_ADDR              0x0295
#define CCPR2L_ADDR             0x0295
#define CCPR2H_ADDR             0x0296
#define CCP2CON_ADDR            0x0297
#define CCP2CAP_ADDR            0x0298
#define CCPR7_ADDR              0x0299
#define CCPR7L_ADDR             0x0299
#define CCPR7H_ADDR             0x029A
#define CCP7CON_ADDR            0x029B
#define CCP7CAP_ADDR            0x029C
#define CCPTMRS1_ADDR           0x029E
#define CCPTMRS2_ADDR           0x029F
#define SLRCONA_ADDR            0x030C
#define SLRCONB_ADDR            0x030D
#define SLRCONC_ADDR            0x030E
#define MD1CON0_ADDR            0x0315
#define MD1CON1_ADDR            0x0316
#define MD1SRC_ADDR             0x0317
#define MD1CARL_ADDR            0x0318
#define MD1CARH_ADDR            0x0319
#define MD2CON0_ADDR            0x031B
#define MD2CON1_ADDR            0x031C
#define MD2SRC_ADDR             0x031D
#define MD2CARL_ADDR            0x031E
#define MD2CARH_ADDR            0x031F
#define INLVLA_ADDR             0x038C
#define INLVLB_ADDR             0x038D
#define INLVLC_ADDR             0x038E
#define INLVE_ADDR              0x0390
#define IOCAP_ADDR              0x0391
#define IOCAN_ADDR              0x0392
#define IOCAF_ADDR              0x0393
#define IOCBP_ADDR              0x0394
#define IOCBN_ADDR              0x0395
#define IOCBF_ADDR              0x0396
#define IOCCP_ADDR              0x0397
#define IOCCN_ADDR              0x0398
#define IOCCF_ADDR              0x0399
#define IOCEP_ADDR              0x039D
#define IOCEN_ADDR              0x039E
#define IOCEF_ADDR              0x039F
#define HIDRVB_ADDR             0x040D
#define TMR5_ADDR               0x040F
#define TMR5L_ADDR              0x040F
#define TMR5H_ADDR              0x0410
#define T5CON_ADDR              0x0411
#define T5GCON_ADDR             0x0412
#define T4TMR_ADDR              0x0413
#define TMR4_ADDR               0x0413
#define PR4_ADDR                0x0414
#define T4PR_ADDR               0x0414
#define T4CON_ADDR              0x0415
#define T4HLT_ADDR              0x0416
#define T4CLKCON_ADDR           0x0417
#define T4RST_ADDR              0x0418
#define T6TMR_ADDR              0x041A
#define TMR6_ADDR               0x041A
#define PR6_ADDR                0x041B
#define T6PR_ADDR               0x041B
#define T6CON_ADDR              0x041C
#define T6HLT_ADDR              0x041D
#define T6CLKCON_ADDR           0x041E
#define T6RST_ADDR              0x041F
#define ADRESL_ADDR             0x048E
#define ADRESH_ADDR             0x048F
#define ADCON0_ADDR             0x0490
#define ADCON1_ADDR             0x0491
#define ADCON2_ADDR             0x0492
#define T2TMR_ADDR              0x0493
#define TMR2_ADDR               0x0493
#define PR2_ADDR                0x0494
#define T2PR_ADDR               0x0494
#define T2CON_ADDR              0x0495
#define T2HLT_ADDR              0x0496
#define T2CLKCON_ADDR           0x0497
#define T2RST_ADDR              0x0498
#define T8TMR_ADDR              0x049A
#define TMR8_ADDR               0x049A
#define PR8_ADDR                0x049B
#define T8PR_ADDR               0x049B
#define T8CON_ADDR              0x049C
#define T8HLT_ADDR              0x049D
#define T8CLKCON_ADDR           0x049E
#define T8RST_ADDR              0x049F
#define OPA1NCHS_ADDR           0x050F
#define OPA1PCHS_ADDR           0x0510
#define OPA1CON_ADDR            0x0511
#define OPA1ORS_ADDR            0x0512
#define OPA2NCHS_ADDR           0x0513
#define OPA2PCHS_ADDR           0x0514
#define OPA2CON_ADDR            0x0515
#define OPA2ORS_ADDR            0x0516
#define OPA3NCHS_ADDR           0x0517
#define OPA3PCHS_ADDR           0x0518
#define OPA3CON_ADDR            0x0519
#define OPA3ORS_ADDR            0x051A
#define DACLD_ADDR              0x058D
#define DAC1CON0_ADDR           0x058E
#define DAC1CON1_ADDR           0x058F
#define DAC1REF_ADDR            0x058F
#define DAC1REFL_ADDR           0x058F
#define DAC1CON2_ADDR           0x0590
#define DAC1REFH_ADDR           0x0590
#define DAC2CON0_ADDR           0x0591
#define DAC2CON1_ADDR           0x0592
#define DAC2REF_ADDR            0x0592
#define DAC2REFL_ADDR           0x0592
#define DAC2CON2_ADDR           0x0593
#define DAC2REFH_ADDR           0x0593
#define DAC3CON0_ADDR           0x0594
#define DAC3CON1_ADDR           0x0595
#define DAC3REF_ADDR            0x0595
#define DAC4CON0_ADDR           0x0596
#define DAC4CON1_ADDR           0x0597
#define DAC4REF_ADDR            0x0597
#define DAC5CON0_ADDR           0x0598
#define DAC5CON1_ADDR           0x0599
#define DAC5REF_ADDR            0x0599
#define DAC5REFL_ADDR           0x0599
#define DAC5CON2_ADDR           0x059A
#define DAC5REFH_ADDR           0x059A
#define DAC7CON0_ADDR           0x059E
#define DAC7CON1_ADDR           0x059F
#define DAC7REF_ADDR            0x059F
#define PWM3DCL_ADDR            0x0614
#define PWM3DCH_ADDR            0x0615
#define PWM3CON_ADDR            0x0616
#define PWM4DCL_ADDR            0x0617
#define PWM4DCH_ADDR            0x0618
#define PWM4CON_ADDR            0x0619
#define PWM9DCL_ADDR            0x061A
#define PWM9DCH_ADDR            0x061B
#define PWM9CON_ADDR            0x061C
#define COG1PHR_ADDR            0x068D
#define COG1PHF_ADDR            0x068E
#define COG1BLKR_ADDR           0x068F
#define COG1BLKF_ADDR           0x0690
#define COG1DBR_ADDR            0x0691
#define COG1DBF_ADDR            0x0692
#define COG1CON0_ADDR           0x0693
#define COG1CON1_ADDR           0x0694
#define COG1RIS0_ADDR           0x0695
#define COG1RIS1_ADDR           0x0696
#define COG1RSIM0_ADDR          0x0697
#define COG1RSIM1_ADDR          0x0698
#define COG1FIS0_ADDR           0x0699
#define COG1FIS1_ADDR           0x069A
#define COG1FSIM0_ADDR          0x069B
#define COG1FSIM1_ADDR          0x069C
#define COG1ASD0_ADDR           0x069D
#define COG1ASD1_ADDR           0x069E
#define COG1STR_ADDR            0x069F
#define COG2PHR_ADDR            0x070D
#define COG2PHF_ADDR            0x070E
#define COG2BLKR_ADDR           0x070F
#define COG2BLKF_ADDR           0x0710
#define COG2DBR_ADDR            0x0711
#define COG2DBF_ADDR            0x0712
#define COG2CON0_ADDR           0x0713
#define COG2CON1_ADDR           0x0714
#define COG2RIS0_ADDR           0x0715
#define COG2RIS1_ADDR           0x0716
#define COG2RSIM0_ADDR          0x0717
#define COG2RSIM1_ADDR          0x0718
#define COG2FIS0_ADDR           0x0719
#define COG2FIS1_ADDR           0x071A
#define COG2FSIM0_ADDR          0x071B
#define COG2FSIM1_ADDR          0x071C
#define COG2ASD0_ADDR           0x071D
#define COG2ASD1_ADDR           0x071E
#define COG2STR_ADDR            0x071F
#define PRG1RTSS_ADDR           0x078E
#define PRG1FTSS_ADDR           0x078F
#define PRG1INS_ADDR            0x0790
#define PRG1CON0_ADDR           0x0791
#define PRG1CON1_ADDR           0x0792
#define PRG1CON2_ADDR           0x0793
#define PRG2RTSS_ADDR           0x0794
#define PRG2FTSS_ADDR           0x0795
#define PRG2INS_ADDR            0x0796
#define PRG2CON0_ADDR           0x0797
#define PRG2CON1_ADDR           0x0798
#define PRG2CON2_ADDR           0x0799
#define PRG3RTSS_ADDR           0x079A
#define PRG3FTSS_ADDR           0x079B
#define PRG3INS_ADDR            0x079C
#define PRG3CON0_ADDR           0x079D
#define PRG3CON1_ADDR           0x079E
#define PRG3CON2_ADDR           0x079F
#define COG3PHR_ADDR            0x080D
#define COG3PHF_ADDR            0x080E
#define COG3BLKR_ADDR           0x080F
#define COG3BLKF_ADDR           0x0810
#define COG3DBR_ADDR            0x0811
#define COG3DBF_ADDR            0x0812
#define COG3CON0_ADDR           0x0813
#define COG3CON1_ADDR           0x0814
#define COG3RIS0_ADDR           0x0815
#define COG3RIS1_ADDR           0x0816
#define COG3RSIM0_ADDR          0x0817
#define COG3RSIM1_ADDR          0x0818
#define COG3FIS0_ADDR           0x0819
#define COG3FIS1_ADDR           0x081A
#define COG3FSIM0_ADDR          0x081B
#define COG3FSIM1_ADDR          0x081C
#define COG3ASD0_ADDR           0x081D
#define COG3ASD1_ADDR           0x081E
#define COG3STR_ADDR            0x081F
#define CM4CON0_ADDR            0x090C
#define CM4CON1_ADDR            0x090D
#define CM4NSEL_ADDR            0x090E
#define CM4PSEL_ADDR            0x090F
#define CM5CON0_ADDR            0x0910
#define CM5CON1_ADDR            0x0911
#define CM5NSEL_ADDR            0x0912
#define CM5PSEL_ADDR            0x0913
#define CM6CON0_ADDR            0x0914
#define CM6CON1_ADDR            0x0915
#define CM6NSEL_ADDR            0x0916
#define CM6PSEL_ADDR            0x0917
#define PWMEN_ADDR              0x0D8E
#define PWMLD_ADDR              0x0D8F
#define PWMOUT_ADDR             0x0D90
#define PWM5PH_ADDR             0x0D91
#define PWM5PHL_ADDR            0x0D91
#define PWM5PHH_ADDR            0x0D92
#define PWM5DC_ADDR             0x0D93
#define PWM5DCL_ADDR            0x0D93
#define PWM5DCH_ADDR            0x0D94
#define PWM5PR_ADDR             0x0D95
#define PWM5PRL_ADDR            0x0D95
#define PWM5PRH_ADDR            0x0D96
#define PWM5OF_ADDR             0x0D97
#define PWM5OFL_ADDR            0x0D97
#define PWM5OFH_ADDR            0x0D98
#define PWM5TMR_ADDR            0x0D99
#define PWM5TMRL_ADDR           0x0D99
#define PWM5TMRH_ADDR           0x0D9A
#define PWM5CON_ADDR            0x0D9B
#define PWM5INTCON_ADDR         0x0D9C
#define PWM5INTE_ADDR           0x0D9C
#define PWM5INTF_ADDR           0x0D9D
#define PWM5INTFLG_ADDR         0x0D9D
#define PWM5CLKCON_ADDR         0x0D9E
#define PWM5LDCON_ADDR          0x0D9F
#define PWM5OFCON_ADDR          0x0DA0
#define PWM6PH_ADDR             0x0DA1
#define PWM6PHL_ADDR            0x0DA1
#define PWM6PHH_ADDR            0x0DA2
#define PWM6DC_ADDR             0x0DA3
#define PWM6DCL_ADDR            0x0DA3
#define PWM6DCH_ADDR            0x0DA4
#define PWM6PR_ADDR             0x0DA5
#define PWM6PRL_ADDR            0x0DA5
#define PWM6PRH_ADDR            0x0DA6
#define PWM6OF_ADDR             0x0DA7
#define PWM6OFL_ADDR            0x0DA7
#define PWM6OFH_ADDR            0x0DA8
#define PWM6TMR_ADDR            0x0DA9
#define PWM6TMRL_ADDR           0x0DA9
#define PWM6TMRH_ADDR           0x0DAA
#define PWM6CON_ADDR            0x0DAB
#define PWM6INTCON_ADDR         0x0DAC
#define PWM6INTE_ADDR           0x0DAC
#define PWM6INTF_ADDR           0x0DAD
#define PWM6INTFLG_ADDR         0x0DAD
#define PWM6CLKCON_ADDR         0x0DAE
#define PWM6LDCON_ADDR          0x0DAF
#define PWM6OFCON_ADDR          0x0DB0
#define PWM11PH_ADDR            0x0DB1
#define PWM11PHL_ADDR           0x0DB1
#define PWM11PHH_ADDR           0x0DB2
#define PWM11DC_ADDR            0x0DB3
#define PWM11DCL_ADDR           0x0DB3
#define PWM11DCH_ADDR           0x0DB4
#define PWM11PR_ADDR            0x0DB5
#define PWM11PRL_ADDR           0x0DB5
#define PWM11PRH_ADDR           0x0DB6
#define PWM11OF_ADDR            0x0DB7
#define PWM11OFL_ADDR           0x0DB7
#define PWM11OFH_ADDR           0x0DB8
#define PWM11TMR_ADDR           0x0DB9
#define PWM11TMRL_ADDR          0x0DB9
#define PWM11TMRH_ADDR          0x0DBA
#define PWM11CON_ADDR           0x0DBB
#define PWM11INTCON_ADDR        0x0DBC
#define PWM11INTE_ADDR          0x0DBC
#define PWM11INTF_ADDR          0x0DBD
#define PWM11INTFLG_ADDR        0x0DBD
#define PWM11CLKCON_ADDR        0x0DBE
#define PWM11LDCON_ADDR         0x0DBF
#define PWM11OFCON_ADDR         0x0DC0
#define PPSLOCK_ADDR            0x0E0C
#define INTPPS_ADDR             0x0E0D
#define T0CKIPPS_ADDR           0x0E0E
#define T1CKIPPS_ADDR           0x0E0F
#define T1GPPS_ADDR             0x0E10
#define T3CKIPPS_ADDR           0x0E11
#define T3GPPS_ADDR             0x0E12
#define T5CKIPPS_ADDR           0x0E13
#define T5GPPS_ADDR             0x0E14
#define T2CKIPPS_ADDR           0x0E15
#define T4CKIPPS_ADDR           0x0E16
#define T6CKIPPS_ADDR           0x0E17
#define T8CKIPPS_ADDR           0x0E18
#define CCP1PPS_ADDR            0x0E19
#define CCP2PPS_ADDR            0x0E1A
#define CCP7PPS_ADDR            0x0E1B
#define COG1INPPS_ADDR          0x0E1D
#define COG2INPPS_ADDR          0x0E1E
#define COG3INPPS_ADDR          0x0E1F
#define MD1CLPPS_ADDR           0x0E21
#define MD1CHPPS_ADDR           0x0E22
#define MD1MODPPS_ADDR          0x0E23
#define MD2CLPPS_ADDR           0x0E24
#define MD2CHPPS_ADDR           0x0E25
#define MD2MODPPS_ADDR          0x0E26
#define MD3CLPPS_ADDR           0x0E27
#define MD3CHPPS_ADDR           0x0E28
#define MD3MODPPS_ADDR          0x0E29
#define PRG1RPPS_ADDR           0x0E2D
#define PRG1FPPS_ADDR           0x0E2E
#define PRG2RPPS_ADDR           0x0E2F
#define PRG2FPPS_ADDR           0x0E30
#define PRG3RPPS_ADDR           0x0E31
#define PRG3FPPS_ADDR           0x0E32
#define CLCIN0PPS_ADDR          0x0E35
#define CLCIN1PPS_ADDR          0x0E36
#define CLCIN2PPS_ADDR          0x0E37
#define CLCIN3PPS_ADDR          0x0E38
#define ADCACTPPS_ADDR          0x0E39
#define SSPCLKPPS_ADDR          0x0E3A
#define SSPDATPPS_ADDR          0x0E3B
#define SSPSSPPS_ADDR           0x0E3C
#define RXPPS_ADDR              0x0E3D
#define CKPPS_ADDR              0x0E3E
#define RA0PPS_ADDR             0x0E90
#define RA1PPS_ADDR             0x0E91
#define RA2PPS_ADDR             0x0E92
#define RA3PPS_ADDR             0x0E93
#define RA4PPS_ADDR             0x0E94
#define RA5PPS_ADDR             0x0E95
#define RA6PPS_ADDR             0x0E96
#define RA7PPS_ADDR             0x0E97
#define RB0PPS_ADDR             0x0E98
#define RB1PPS_ADDR             0x0E99
#define RB2PPS_ADDR             0x0E9A
#define RB3PPS_ADDR             0x0E9B
#define RB4PPS_ADDR             0x0E9C
#define RB5PPS_ADDR             0x0E9D
#define RB6PPS_ADDR             0x0E9E
#define RB7PPS_ADDR             0x0E9F
#define RC0PPS_ADDR             0x0EA0
#define RC1PPS_ADDR             0x0EA1
#define RC2PPS_ADDR             0x0EA2
#define RC3PPS_ADDR             0x0EA3
#define RC4PPS_ADDR             0x0EA4
#define RC5PPS_ADDR             0x0EA5
#define RC6PPS_ADDR             0x0EA6
#define RC7PPS_ADDR             0x0EA7
#define CLCDATA_ADDR            0x0F0F
#define CLC1CON_ADDR            0x0F10
#define CLC1POL_ADDR            0x0F11
#define CLC1SEL0_ADDR           0x0F12
#define CLC1SEL1_ADDR           0x0F13
#define CLC1SEL2_ADDR           0x0F14
#define CLC1SEL3_ADDR           0x0F15
#define CLC1GLS0_ADDR           0x0F16
#define CLC1GLS1_ADDR           0x0F17
#define CLC1GLS2_ADDR           0x0F18
#define CLC1GLS3_ADDR           0x0F19
#define CLC2CON_ADDR            0x0F1A
#define CLC2POL_ADDR            0x0F1B
#define CLC2SEL0_ADDR           0x0F1C
#define CLC2SEL1_ADDR           0x0F1D
#define CLC2SEL2_ADDR           0x0F1E
#define CLC2SEL3_ADDR           0x0F1F
#define CLC2GLS0_ADDR           0x0F20
#define CLC2GLS1_ADDR           0x0F21
#define CLC2GLS2_ADDR           0x0F22
#define CLC2GLS3_ADDR           0x0F23
#define CLC3CON_ADDR            0x0F24
#define CLC3POL_ADDR            0x0F25
#define CLC3SEL0_ADDR           0x0F26
#define CLC3SEL1_ADDR           0x0F27
#define CLC3SEL2_ADDR           0x0F28
#define CLC3SEL3_ADDR           0x0F29
#define CLC3GLS0_ADDR           0x0F2A
#define CLC3GLS1_ADDR           0x0F2B
#define CLC3GLS2_ADDR           0x0F2C
#define CLC3GLS3_ADDR           0x0F2D
#define CLC4CON_ADDR            0x0F2E
#define CLC4POL_ADDR            0x0F2F
#define CLC4SEL0_ADDR           0x0F30
#define CLC4SEL1_ADDR           0x0F31
#define CLC4SEL2_ADDR           0x0F32
#define CLC4SEL3_ADDR           0x0F33
#define CLC4GLS0_ADDR           0x0F34
#define CLC4GLS1_ADDR           0x0F35
#define CLC4GLS2_ADDR           0x0F36
#define CLC4GLS3_ADDR           0x0F37
#define STATUS_SHAD_ADDR        0x0FE4
#define WREG_SHAD_ADDR          0x0FE5
#define BSR_SHAD_ADDR           0x0FE6
#define PCLATH_SHAD_ADDR        0x0FE7
#define FSR0L_SHAD_ADDR         0x0FE8
#define FSR0H_SHAD_ADDR         0x0FE9
#define FSR1L_SHAD_ADDR         0x0FEA
#define FSR1H_SHAD_ADDR         0x0FEB
#define STKPTR_ADDR             0x0FED
#define TOSL_ADDR               0x0FEE
#define TOSH_ADDR               0x0FEF

#endif // #ifndef NO_ADDR_DEFINES

//==============================================================================
//
//	Register Definitions
//
//==============================================================================

