OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1773.h
extern __at(0x080D) __sfr COG3PHR;

typedef union
  {
  struct
    {
    unsigned PHR0               : 1;
    unsigned PHR1               : 1;
    unsigned PHR2               : 1;
    unsigned PHR3               : 1;
    unsigned PHR4               : 1;
    unsigned PHR5               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned G3PHR0             : 1;
    unsigned G3PHR1             : 1;
    unsigned G3PHR2             : 1;
    unsigned G3PHR3             : 1;
    unsigned G3PHR4             : 1;
    unsigned G3PHR5             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned PHR                : 6;
    unsigned                    : 2;
    };

  struct
    {
    unsigned G3PHR              : 6;
    unsigned                    : 2;
    };
  } __COG3PHRbits_t;

extern __at(0x080D) volatile __COG3PHRbits_t COG3PHRbits;

#define _COG3PHR_PHR0           0x01
#define _COG3PHR_G3PHR0         0x01
#define _COG3PHR_PHR1           0x02
#define _COG3PHR_G3PHR1         0x02
#define _COG3PHR_PHR2           0x04
#define _COG3PHR_G3PHR2         0x04
#define _COG3PHR_PHR3           0x08
#define _COG3PHR_G3PHR3         0x08
#define _COG3PHR_PHR4           0x10
#define _COG3PHR_G3PHR4         0x10
#define _COG3PHR_PHR5           0x20
#define _COG3PHR_G3PHR5         0x20

//==============================================================================


//==============================================================================
//        COG3PHF Bits

extern __at(0x080E) __sfr COG3PHF;

typedef union
  {
  struct
    {
    unsigned PHF0               : 1;
    unsigned PHF1               : 1;
    unsigned PHF2               : 1;
    unsigned PHF3               : 1;
    unsigned PHF4               : 1;
    unsigned PHF5               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned G3PHF0             : 1;
    unsigned G3PHF1             : 1;
    unsigned G3PHF2             : 1;
    unsigned G3PHF3             : 1;
    unsigned G3PHF4             : 1;
    unsigned G3PHF5             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned PHF                : 6;
    unsigned                    : 2;
    };

  struct
    {
    unsigned G3PHF              : 6;
    unsigned                    : 2;
    };
  } __COG3PHFbits_t;

extern __at(0x080E) volatile __COG3PHFbits_t COG3PHFbits;

#define _COG3PHF_PHF0           0x01
#define _COG3PHF_G3PHF0         0x01
#define _COG3PHF_PHF1           0x02
#define _COG3PHF_G3PHF1         0x02
#define _COG3PHF_PHF2           0x04
#define _COG3PHF_G3PHF2         0x04
#define _COG3PHF_PHF3           0x08
#define _COG3PHF_G3PHF3         0x08
#define _COG3PHF_PHF4           0x10
#define _COG3PHF_G3PHF4         0x10
#define _COG3PHF_PHF5           0x20
#define _COG3PHF_G3PHF5         0x20

//==============================================================================


//==============================================================================
//        COG3BLKR Bits

extern __at(0x080F) __sfr COG3BLKR;

typedef union
  {
  struct
    {
    unsigned BLKR0              : 1;
    unsigned BLKR1              : 1;
    unsigned BLKR2              : 1;
    unsigned BLKR3              : 1;
    unsigned BLKR4              : 1;
    unsigned BLKR5              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned G3BLKR0            : 1;
    unsigned G3BLKR1            : 1;
    unsigned G3BLKR2            : 1;
    unsigned G3BLKR3            : 1;
    unsigned G3BLKR4            : 1;
    unsigned G3BLKR5            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned G3BLKR             : 6;
    unsigned                    : 2;
    };

  struct
    {
    unsigned BLKR               : 6;
    unsigned                    : 2;
    };
  } __COG3BLKRbits_t;

extern __at(0x080F) volatile __COG3BLKRbits_t COG3BLKRbits;

#define _COG3BLKR_BLKR0         0x01
#define _COG3BLKR_G3BLKR0       0x01
#define _COG3BLKR_BLKR1         0x02
#define _COG3BLKR_G3BLKR1       0x02
#define _COG3BLKR_BLKR2         0x04
#define _COG3BLKR_G3BLKR2       0x04
#define _COG3BLKR_BLKR3         0x08
#define _COG3BLKR_G3BLKR3       0x08
#define _COG3BLKR_BLKR4         0x10
#define _COG3BLKR_G3BLKR4       0x10
#define _COG3BLKR_BLKR5         0x20
#define _COG3BLKR_G3BLKR5       0x20

//==============================================================================


//==============================================================================
//        COG3BLKF Bits

extern __at(0x0810) __sfr COG3BLKF;

typedef union
  {
  struct
    {
    unsigned BLKF0              : 1;
    unsigned BLKF1              : 1;
    unsigned BLKF2              : 1;
    unsigned BLKF3              : 1;
    unsigned BLKF4              : 1;
    unsigned BLKF5              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned G3BLKF0            : 1;
    unsigned G3BLKF1            : 1;
    unsigned G3BLKF2            : 1;
    unsigned G3BLKF3            : 1;
    unsigned G3BLKF4            : 1;
    unsigned G3BLKF5            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned BLKF               : 6;
    unsigned                    : 2;
    };

  struct
    {
    unsigned G3BLKF             : 6;
    unsigned                    : 2;
    };
  } __COG3BLKFbits_t;

extern __at(0x0810) volatile __COG3BLKFbits_t COG3BLKFbits;

#define _COG3BLKF_BLKF0         0x01
#define _COG3BLKF_G3BLKF0       0x01
#define _COG3BLKF_BLKF1         0x02
#define _COG3BLKF_G3BLKF1       0x02
#define _COG3BLKF_BLKF2         0x04
#define _COG3BLKF_G3BLKF2       0x04
#define _COG3BLKF_BLKF3         0x08
#define _COG3BLKF_G3BLKF3       0x08
#define _COG3BLKF_BLKF4         0x10
#define _COG3BLKF_G3BLKF4       0x10
#define _COG3BLKF_BLKF5         0x20
#define _COG3BLKF_G3BLKF5       0x20

//==============================================================================


//==============================================================================
//        COG3DBR Bits

