OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1773.h
extern __at(0x0915) __sfr CM6CON1;

typedef union
  {
  struct
    {
    unsigned INTN               : 1;
    unsigned INTP               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned C6INTN             : 1;
    unsigned C6INTP             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __CM6CON1bits_t;

extern __at(0x0915) volatile __CM6CON1bits_t CM6CON1bits;

#define _CM6CON1_INTN           0x01
#define _CM6CON1_C6INTN         0x01
#define _CM6CON1_INTP           0x02
#define _CM6CON1_C6INTP         0x02

//==============================================================================


//==============================================================================
//        CM6NSEL Bits

extern __at(0x0916) __sfr CM6NSEL;

typedef union
  {
  struct
    {
    unsigned C6NCH0             : 1;
    unsigned C6NCH1             : 1;
    unsigned C6NCH2             : 1;
    unsigned C6NCH3             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned C6NCH              : 4;
    unsigned                    : 4;
    };
  } __CM6NSELbits_t;

extern __at(0x0916) volatile __CM6NSELbits_t CM6NSELbits;

#define _C6NCH0                 0x01
#define _C6NCH1                 0x02
#define _C6NCH2                 0x04
#define _C6NCH3                 0x08

//==============================================================================


//==============================================================================
//        CM6PSEL Bits

extern __at(0x0917) __sfr CM6PSEL;

typedef union
  {
  struct
    {
    unsigned PCH0               : 1;
    unsigned PCH1               : 1;
    unsigned PCH2               : 1;
    unsigned PCH3               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned C6PCH0             : 1;
    unsigned C6PCH1             : 1;
    unsigned C6PCH2             : 1;
    unsigned C6PCH3             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned C6PCH              : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned PCH                : 4;
    unsigned                    : 4;
    };
  } __CM6PSELbits_t;

extern __at(0x0917) volatile __CM6PSELbits_t CM6PSELbits;

#define _CM6PSEL_PCH0           0x01
#define _CM6PSEL_C6PCH0         0x01
#define _CM6PSEL_PCH1           0x02
#define _CM6PSEL_C6PCH1         0x02
#define _CM6PSEL_PCH2           0x04
#define _CM6PSEL_C6PCH2         0x04
#define _CM6PSEL_PCH3           0x08
#define _CM6PSEL_C6PCH3         0x08

//==============================================================================


//==============================================================================
//        PWMEN Bits

extern __at(0x0D8E) __sfr PWMEN;

typedef struct
  {
  unsigned MPWM5EN              : 1;
  unsigned MPWM6EN              : 1;
  unsigned MPWM11EN             : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __PWMENbits_t;

extern __at(0x0D8E) volatile __PWMENbits_t PWMENbits;

#define _MPWM5EN                0x01
#define _MPWM6EN                0x02
#define _MPWM11EN               0x04

//==============================================================================


//==============================================================================
//        PWMLD Bits

extern __at(0x0D8F) __sfr PWMLD;

typedef struct
  {
  unsigned MPWM5LD              : 1;
  unsigned MPWM6LD              : 1;
  unsigned MPWM11LD             : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __PWMLDbits_t;

extern __at(0x0D8F) volatile __PWMLDbits_t PWMLDbits;

#define _MPWM5LD                0x01
#define _MPWM6LD                0x02
#define _MPWM11LD               0x04

//==============================================================================


//==============================================================================
//        PWMOUT Bits

extern __at(0x0D90) __sfr PWMOUT;

typedef struct
  {
  unsigned MPWM5OUT             : 1;
  unsigned MPWM6OUT             : 1;
  unsigned MPWM11OUT            : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __PWMOUTbits_t;

extern __at(0x0D90) volatile __PWMOUTbits_t PWMOUTbits;

#define _MPWM5OUT               0x01
#define _MPWM6OUT               0x02
#define _MPWM11OUT              0x04

//==============================================================================

extern __at(0x0D91) __sfr PWM5PH;

//==============================================================================
//        PWM5PHL Bits

extern __at(0x0D91) __sfr PWM5PHL;

typedef struct
  {
  unsigned PWM5PHL0             : 1;
  unsigned PWM5PHL1             : 1;
  unsigned PWM5PHL2             : 1;
  unsigned PWM5PHL3             : 1;
  unsigned PWM5PHL4             : 1;
  unsigned PWM5PHL5             : 1;
  unsigned PWM5PHL6             : 1;
  unsigned PWM5PHL7             : 1;
  } __PWM5PHLbits_t;

extern __at(0x0D91) volatile __PWM5PHLbits_t PWM5PHLbits;

#define _PWM5PHL0               0x01
#define _PWM5PHL1               0x02
#define _PWM5PHL2               0x04
#define _PWM5PHL3               0x08
#define _PWM5PHL4               0x10
#define _PWM5PHL5               0x20
#define _PWM5PHL6               0x40
#define _PWM5PHL7               0x80

//==============================================================================


//==============================================================================
//        PWM5PHH Bits

extern __at(0x0D92) __sfr PWM5PHH;

typedef struct
  {
  unsigned PWM5PHH0             : 1;
  unsigned PWM5PHH1             : 1;
  unsigned PWM5PHH2             : 1;
  unsigned PWM5PHH3             : 1;
  unsigned PWM5PHH4             : 1;
  unsigned PWM5PHH5             : 1;
  unsigned PWM5PHH6             : 1;
  unsigned PWM5PHH7             : 1;
  } __PWM5PHHbits_t;

extern __at(0x0D92) volatile __PWM5PHHbits_t PWM5PHHbits;

#define _PWM5PHH0               0x01
#define _PWM5PHH1               0x02
#define _PWM5PHH2               0x04
#define _PWM5PHH3               0x08
#define _PWM5PHH4               0x10
#define _PWM5PHH5               0x20
#define _PWM5PHH6               0x40
#define _PWM5PHH7               0x80

//==============================================================================

