OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1773.h
extern __at(0x0DB0) __sfr PWM6OFCON;

typedef union
  {
  struct
    {
    unsigned PWM6OFS0           : 1;
    unsigned PWM6OFS1           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned OFO                : 1;
    unsigned PWM6OFM0           : 1;
    unsigned PWM6OFM1           : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned OFS0               : 1;
    unsigned OFS1               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PWM6OFMC           : 1;
    unsigned OFM0               : 1;
    unsigned OFM1               : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned PWM6OFS            : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned OFS                : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 5;
    unsigned OFM                : 2;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 5;
    unsigned PWM6OFM            : 2;
    unsigned                    : 1;
    };
  } __PWM6OFCONbits_t;

extern __at(0x0DB0) volatile __PWM6OFCONbits_t PWM6OFCONbits;

#define _PWM6OFCON_PWM6OFS0     0x01
#define _PWM6OFCON_OFS0         0x01
#define _PWM6OFCON_PWM6OFS1     0x02
#define _PWM6OFCON_OFS1         0x02
#define _PWM6OFCON_OFO          0x10
#define _PWM6OFCON_PWM6OFMC     0x10
#define _PWM6OFCON_PWM6OFM0     0x20
#define _PWM6OFCON_OFM0         0x20
#define _PWM6OFCON_PWM6OFM1     0x40
#define _PWM6OFCON_OFM1         0x40

//==============================================================================

extern __at(0x0DB1) __sfr PWM11PH;

//==============================================================================
//        PWM11PHL Bits

extern __at(0x0DB1) __sfr PWM11PHL;

typedef struct
  {
  unsigned PWM11PHL0            : 1;
  unsigned PWM11PHL1            : 1;
  unsigned PWM11PHL2            : 1;
  unsigned PWM11PHL3            : 1;
  unsigned PWM11PHL4            : 1;
  unsigned PWM11PHL5            : 1;
  unsigned PWM11PHL6            : 1;
  unsigned PWM11PHL7            : 1;
  } __PWM11PHLbits_t;

extern __at(0x0DB1) volatile __PWM11PHLbits_t PWM11PHLbits;

#define _PWM11PHL0              0x01
#define _PWM11PHL1              0x02
#define _PWM11PHL2              0x04
#define _PWM11PHL3              0x08
#define _PWM11PHL4              0x10
#define _PWM11PHL5              0x20
#define _PWM11PHL6              0x40
#define _PWM11PHL7              0x80

//==============================================================================


//==============================================================================
//        PWM11PHH Bits

extern __at(0x0DB2) __sfr PWM11PHH;

typedef struct
  {
  unsigned PWM11PHH0            : 1;
  unsigned PWM11PHH1            : 1;
  unsigned PWM11PHH2            : 1;
  unsigned PWM11PHH3            : 1;
  unsigned PWM11PHH4            : 1;
  unsigned PWM11PHH5            : 1;
  unsigned PWM11PHH6            : 1;
  unsigned PWM11PHH7            : 1;
  } __PWM11PHHbits_t;

extern __at(0x0DB2) volatile __PWM11PHHbits_t PWM11PHHbits;

#define _PWM11PHH0              0x01
#define _PWM11PHH1              0x02
#define _PWM11PHH2              0x04
#define _PWM11PHH3              0x08
#define _PWM11PHH4              0x10
#define _PWM11PHH5              0x20
#define _PWM11PHH6              0x40
#define _PWM11PHH7              0x80

//==============================================================================

extern __at(0x0DB3) __sfr PWM11DC;

//==============================================================================
//        PWM11DCL Bits

extern __at(0x0DB3) __sfr PWM11DCL;

typedef struct
  {
  unsigned PWM11DCL0            : 1;
  unsigned PWM11DCL1            : 1;
  unsigned PWM11DCL2            : 1;
  unsigned PWM11DCL3            : 1;
  unsigned PWM11DCL4            : 1;
  unsigned PWM11DCL5            : 1;
  unsigned PWM11DCL6            : 1;
  unsigned PWM11DCL7            : 1;
  } __PWM11DCLbits_t;

extern __at(0x0DB3) volatile __PWM11DCLbits_t PWM11DCLbits;

#define _PWM11DCL0              0x01
#define _PWM11DCL1              0x02
#define _PWM11DCL2              0x04
#define _PWM11DCL3              0x08
#define _PWM11DCL4              0x10
#define _PWM11DCL5              0x20
#define _PWM11DCL6              0x40
#define _PWM11DCL7              0x80

//==============================================================================


//==============================================================================
//        PWM11DCH Bits

extern __at(0x0DB4) __sfr PWM11DCH;

typedef struct
  {
  unsigned PWM11DCH0            : 1;
  unsigned PWM11DCH1            : 1;
  unsigned PWM11DCH2            : 1;
  unsigned PWM11DCH3            : 1;
  unsigned PWM11DCH4            : 1;
  unsigned PWM11DCH5            : 1;
  unsigned PWM11DCH6            : 1;
  unsigned PWM11DCH7            : 1;
  } __PWM11DCHbits_t;

extern __at(0x0DB4) volatile __PWM11DCHbits_t PWM11DCHbits;

#define _PWM11DCH0              0x01
#define _PWM11DCH1              0x02
#define _PWM11DCH2              0x04
#define _PWM11DCH3              0x08
#define _PWM11DCH4              0x10
#define _PWM11DCH5              0x20
#define _PWM11DCH6              0x40
#define _PWM11DCH7              0x80

//==============================================================================

extern __at(0x0DB5) __sfr PWM11PR;

//==============================================================================
//        PWM11PRL Bits

extern __at(0x0DB5) __sfr PWM11PRL;

typedef struct
  {
  unsigned PWM11PRL0            : 1;
  unsigned PWM11PRL1            : 1;
  unsigned PWM11PRL2            : 1;
  unsigned PWM11PRL3            : 1;
  unsigned PWM11PRL4            : 1;
  unsigned PWM11PRL5            : 1;
  unsigned PWM11PRL6            : 1;
  unsigned PWM11PRL7            : 1;
  } __PWM11PRLbits_t;

extern __at(0x0DB5) volatile __PWM11PRLbits_t PWM11PRLbits;

#define _PWM11PRL0              0x01
#define _PWM11PRL1              0x02
#define _PWM11PRL2              0x04
#define _PWM11PRL3              0x08
#define _PWM11PRL4              0x10
#define _PWM11PRL5              0x20
#define _PWM11PRL6              0x40
#define _PWM11PRL7              0x80

//==============================================================================


//==============================================================================
//        PWM11PRH Bits

extern __at(0x0DB6) __sfr PWM11PRH;

typedef struct
  {
  unsigned PWM11PRH0            : 1;
  unsigned PWM11PRH1            : 1;
  unsigned PWM11PRH2            : 1;
  unsigned PWM11PRH3            : 1;
  unsigned PWM11PRH4            : 1;
  unsigned PWM11PRH5            : 1;
  unsigned PWM11PRH6            : 1;
  unsigned PWM11PRH7            : 1;
  } __PWM11PRHbits_t;

extern __at(0x0DB6) volatile __PWM11PRHbits_t PWM11PRHbits;

