OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1773.h
#define PWM6TMRL0               PWM6TMRLbits.PWM6TMRL0          // bit 0
#define PWM6TMRL1               PWM6TMRLbits.PWM6TMRL1          // bit 1
#define PWM6TMRL2               PWM6TMRLbits.PWM6TMRL2          // bit 2
#define PWM6TMRL3               PWM6TMRLbits.PWM6TMRL3          // bit 3
#define PWM6TMRL4               PWM6TMRLbits.PWM6TMRL4          // bit 4
#define PWM6TMRL5               PWM6TMRLbits.PWM6TMRL5          // bit 5
#define PWM6TMRL6               PWM6TMRLbits.PWM6TMRL6          // bit 6
#define PWM6TMRL7               PWM6TMRLbits.PWM6TMRL7          // bit 7

#define PWM11DCH0               PWM11DCHbits.PWM11DCH0          // bit 0
#define PWM11DCH1               PWM11DCHbits.PWM11DCH1          // bit 1
#define PWM11DCH2               PWM11DCHbits.PWM11DCH2          // bit 2
#define PWM11DCH3               PWM11DCHbits.PWM11DCH3          // bit 3
#define PWM11DCH4               PWM11DCHbits.PWM11DCH4          // bit 4
#define PWM11DCH5               PWM11DCHbits.PWM11DCH5          // bit 5
#define PWM11DCH6               PWM11DCHbits.PWM11DCH6          // bit 6
#define PWM11DCH7               PWM11DCHbits.PWM11DCH7          // bit 7

#define PWM11DCL0               PWM11DCLbits.PWM11DCL0          // bit 0
#define PWM11DCL1               PWM11DCLbits.PWM11DCL1          // bit 1
#define PWM11DCL2               PWM11DCLbits.PWM11DCL2          // bit 2
#define PWM11DCL3               PWM11DCLbits.PWM11DCL3          // bit 3
#define PWM11DCL4               PWM11DCLbits.PWM11DCL4          // bit 4
#define PWM11DCL5               PWM11DCLbits.PWM11DCL5          // bit 5
#define PWM11DCL6               PWM11DCLbits.PWM11DCL6          // bit 6
#define PWM11DCL7               PWM11DCLbits.PWM11DCL7          // bit 7

#define PWM11OFH0               PWM11OFHbits.PWM11OFH0          // bit 0
#define PWM11OFH1               PWM11OFHbits.PWM11OFH1          // bit 1
#define PWM11OFH2               PWM11OFHbits.PWM11OFH2          // bit 2
#define PWM11OFH3               PWM11OFHbits.PWM11OFH3          // bit 3
#define PWM11OFH4               PWM11OFHbits.PWM11OFH4          // bit 4
#define PWM11OFH5               PWM11OFHbits.PWM11OFH5          // bit 5
#define PWM11OFH6               PWM11OFHbits.PWM11OFH6          // bit 6
#define PWM11OFH7               PWM11OFHbits.PWM11OFH7          // bit 7

#define PWM11OFL0               PWM11OFLbits.PWM11OFL0          // bit 0
#define PWM11OFL1               PWM11OFLbits.PWM11OFL1          // bit 1
#define PWM11OFL2               PWM11OFLbits.PWM11OFL2          // bit 2
#define PWM11OFL3               PWM11OFLbits.PWM11OFL3          // bit 3
#define PWM11OFL4               PWM11OFLbits.PWM11OFL4          // bit 4
#define PWM11OFL5               PWM11OFLbits.PWM11OFL5          // bit 5
#define PWM11OFL6               PWM11OFLbits.PWM11OFL6          // bit 6
#define PWM11OFL7               PWM11OFLbits.PWM11OFL7          // bit 7

#define PWM11PHH0               PWM11PHHbits.PWM11PHH0          // bit 0
#define PWM11PHH1               PWM11PHHbits.PWM11PHH1          // bit 1
#define PWM11PHH2               PWM11PHHbits.PWM11PHH2          // bit 2
#define PWM11PHH3               PWM11PHHbits.PWM11PHH3          // bit 3
#define PWM11PHH4               PWM11PHHbits.PWM11PHH4          // bit 4
#define PWM11PHH5               PWM11PHHbits.PWM11PHH5          // bit 5
#define PWM11PHH6               PWM11PHHbits.PWM11PHH6          // bit 6
#define PWM11PHH7               PWM11PHHbits.PWM11PHH7          // bit 7

#define PWM11PHL0               PWM11PHLbits.PWM11PHL0          // bit 0
#define PWM11PHL1               PWM11PHLbits.PWM11PHL1          // bit 1
#define PWM11PHL2               PWM11PHLbits.PWM11PHL2          // bit 2
#define PWM11PHL3               PWM11PHLbits.PWM11PHL3          // bit 3
#define PWM11PHL4               PWM11PHLbits.PWM11PHL4          // bit 4
#define PWM11PHL5               PWM11PHLbits.PWM11PHL5          // bit 5
#define PWM11PHL6               PWM11PHLbits.PWM11PHL6          // bit 6
#define PWM11PHL7               PWM11PHLbits.PWM11PHL7          // bit 7

#define PWM11PRH0               PWM11PRHbits.PWM11PRH0          // bit 0
#define PWM11PRH1               PWM11PRHbits.PWM11PRH1          // bit 1
#define PWM11PRH2               PWM11PRHbits.PWM11PRH2          // bit 2
#define PWM11PRH3               PWM11PRHbits.PWM11PRH3          // bit 3
#define PWM11PRH4               PWM11PRHbits.PWM11PRH4          // bit 4
#define PWM11PRH5               PWM11PRHbits.PWM11PRH5          // bit 5
#define PWM11PRH6               PWM11PRHbits.PWM11PRH6          // bit 6
#define PWM11PRH7               PWM11PRHbits.PWM11PRH7          // bit 7

#define PWM11PRL0               PWM11PRLbits.PWM11PRL0          // bit 0
#define PWM11PRL1               PWM11PRLbits.PWM11PRL1          // bit 1
#define PWM11PRL2               PWM11PRLbits.PWM11PRL2          // bit 2
#define PWM11PRL3               PWM11PRLbits.PWM11PRL3          // bit 3
#define PWM11PRL4               PWM11PRLbits.PWM11PRL4          // bit 4
#define PWM11PRL5               PWM11PRLbits.PWM11PRL5          // bit 5
#define PWM11PRL6               PWM11PRLbits.PWM11PRL6          // bit 6
#define PWM11PRL7               PWM11PRLbits.PWM11PRL7          // bit 7

#define PWM11TMRH0              PWM11TMRHbits.PWM11TMRH0        // bit 0
#define PWM11TMRH1              PWM11TMRHbits.PWM11TMRH1        // bit 1
#define PWM11TMRH2              PWM11TMRHbits.PWM11TMRH2        // bit 2
#define PWM11TMRH3              PWM11TMRHbits.PWM11TMRH3        // bit 3
#define PWM11TMRH4              PWM11TMRHbits.PWM11TMRH4        // bit 4
#define PWM11TMRH5              PWM11TMRHbits.PWM11TMRH5        // bit 5
#define PWM11TMRH6              PWM11TMRHbits.PWM11TMRH6        // bit 6
#define PWM11TMRH7              PWM11TMRHbits.PWM11TMRH7        // bit 7

#define PWM11TMRL0              PWM11TMRLbits.PWM11TMRL0        // bit 0
#define PWM11TMRL1              PWM11TMRLbits.PWM11TMRL1        // bit 1
#define PWM11TMRL2              PWM11TMRLbits.PWM11TMRL2        // bit 2
#define PWM11TMRL3              PWM11TMRLbits.PWM11TMRL3        // bit 3
#define PWM11TMRL4              PWM11TMRLbits.PWM11TMRL4        // bit 4
#define PWM11TMRL5              PWM11TMRLbits.PWM11TMRL5        // bit 5
#define PWM11TMRL6              PWM11TMRLbits.PWM11TMRL6        // bit 6
#define PWM11TMRL7              PWM11TMRLbits.PWM11TMRL7        // bit 7

#define MPWM5EN                 PWMENbits.MPWM5EN               // bit 0
#define MPWM6EN                 PWMENbits.MPWM6EN               // bit 1
#define MPWM11EN                PWMENbits.MPWM11EN              // bit 2

#define MPWM5LD                 PWMLDbits.MPWM5LD               // bit 0
#define MPWM6LD                 PWMLDbits.MPWM6LD               // bit 1
#define MPWM11LD                PWMLDbits.MPWM11LD              // bit 2

#define MPWM5OUT                PWMOUTbits.MPWM5OUT             // bit 0
#define MPWM6OUT                PWMOUTbits.MPWM6OUT             // bit 1
#define MPWM11OUT               PWMOUTbits.MPWM11OUT            // bit 2

